damien_lowe/week_05/day_02/buds_list/app/controllers/buds_controller.rb

  def index
    @buds = Bud.all
---
SELECT "buds".* FROM "buds"

  def create
    # raise params.inspect
    bud = Bud.new
    bud.name = params[:name]
    bud.family = params[:family]
    bud.ancestors = params[:ancestors]
    bud.THC = params[:THC]
    bud.CBD = params[:CBD]
    bud.image = params[:url]
    bud.save
---
INSERT INTO "buds" ("name", "family", "ancestors", "THC", "CBD") VALUES (?, ?, ?, ?, ?)  [["name", "Northern Lights"], ["family", "Sativa"], ["ancestors", "aw"], ["THC", 2.0], ["CBD", 1.0]]

  def show
    @buds = Bud.find params[:id]
---
SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def edit
    @buds = Bud.find params[:id]
---
SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    bud = Bud.find params[:id]
    bud.update :name => params[:name], :family => params[:family], :ancestors => params[:ancestors], :THC => params[:THC], :CBD => params[:CBD], :image => params[:image]
---
SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "buds" SET "name" = ? WHERE "buds"."id" = ?  [["name", "Stephen Hawking Kush 2"], ["id", 28]]

  def destroy
    bud = Bud.find params[:id]
    bud.destroy
---
SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "buds" WHERE "buds"."id" = ?  [["id", 28]]