damien_lowe/week_05/day_03/musobuds/app/views/artists/show.html.erb

SELECT "buds".* FROM "buds" WHERE "buds"."artist_id" = ?  [["artist_id", 15]]
---

<% @artist.buds.each do | bud | %>