damien_lowe/week_05/day_03/musobuds/app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 11]]
---
  def destroy
    artist = Artist.find params[:id]
    artist.destroy