damien_lowe/week_05/day_03/musobuds/app/controllers/buds_controller.rb

SELECT "buds".* FROM "buds"
---
  def index
    @buds = Bud.all

SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @bud = Bud.find params[:id]

SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]
---
  def edit
    @bud = Bud.find params[:id]

SELECT  "buds".* FROM "buds" WHERE "buds"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]
UPDATE "buds" SET "image" = ?, "artist_id" = ?, "updated_at" = ? WHERE "buds"."id" = ?  [["image", "https://herb.co/wp-content/uploads/2017/05/Jedi-Kush.jpg"], ["artist_id", 16], ["updated_at", "2017-11-22 22:15:25.549709"], ["id", 95]]
---
  def update
    bud = Bud.find params[:id]
    bud.update bud_params