damien_lowe/week_05/day_03/musobuds/app/views/buds/_form.html.erb

SELECT "artists"."name", "artists"."id" FROM "artists"
---
    <%= f.label :artist_id %>
    <%= f.select :artist_id, Artist.pluck(:name, :id), :include_blank => true %>